using System;

namespace lev1dz5a
{
    class Program
    {
        
        static void Main(string[] args)
        {
            /* Выполнил Светлаков Е.С.
            Написать программу, которая выводит на экран ваше имя, фамилию и город проживания */
            string name = "Евгений";
            string surname = "Светлаков";
            string city = "Йошкар-Ола";
            Console.WriteLine($"Имя: {name}, Фамилия: {surname}, Город: {city}");
        }
    }
}
